ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
// code for a boot loader for PIC32 (and other?) MCUs
// Chris Lomont May 2015
#include <stdint.h>  // basic types like uint16_t, etc.
#include <stdbool.h> // type bool
#include <xc.h>      // standard part port definitions

#include "BootLoader.h"

/************************** Overview *******************************************
 *
 * This is a bootloader for PIC32 MCUs, written by Chris Lomont for Hypnocube.
 * It allows flashing PICs from (optionally) encrypted images for upgrading PIC
 * applications in the field. Read the Usage section to see how to use it.
 * www.hypnocube.com
 *  May 2015 - Version 0.5 - initial release
 *
 ******************************************************************************/


/************************** Usage: *********************************************
 * todo
 *  1. Add this file to your program (it makes keeping the config bits in sync)
 *  2. To position it in memory, you must add and modify the linker script.
 *     This is in Microchip distro, has the same name as your PIC, like
 *     p32MX150F128B.ld. We put this in normal flash (see notes), at the
 *     beginning, by splitting the linker script line in the MEMORY section thus
 *
 *
 *       kseg0_program_mem     (rx)  : ORIGIN = 0x9D000000, LENGTH = 0x1F000
 *     into two
 *       hypnocube_bootcode    (rx)  : ORIGIN = 0x9D000000, LENGTH = 0x01000
 *       kseg0_program_mem     (rx)  : ORIGIN = 0x9D001000, LENGTH = 0x1E000
 *
 *     Also reserve one word in RAM by splitting one line
 *
 *        kseg1_data_mem       (w!x)  : ORIGIN = 0xA0000000, LENGTH = 0x8000
 *     into two
 *       hypnocube_bootram    (w!x)  : ORIGIN = 0xA0000000, LENGTH = 0x4
 *       kseg1_data_mem       (w!x)  : ORIGIN = 0xA0000004, LENGTH = 0x8000-4
 *
 *     Next, before the .text: section definition,  add these sections to
 *     map the code to this memory section:
 *
 *        .hcbcode :
 *        {
 *          *(.hcbcode.*)
 *          *(.hcbcode)
 *          KEEP (*(.hcbcode))
 *          KEEP (*(.hcbcode.*))
 *          . = ALIGN(4) ;
 *        } >hypnocube_bootcode
 *        .hcbram :
 *        {
 *          *(.hcbram.*)
 *          *(.hcbram)
 *          KEEP (*(.hcbram))
 *          KEEP (*(.hcbram.*))
 *          . = ALIGN(4) ;
 *        } >hypnocube_bootram
 *
 *     Now the bootloader code and single ram location will be located nicely.
 *
 *
 *  2. set crt0
 *
_startup:

        ##################################################################
        # Bootloader jump added by Chris Lomont from Hypnocube. If this is
        # changed, the check code in the bootloader must be changed, since
        # exactly this code sequence must appear early in the reset area
        ##################################################################
        la      sp,0xA0000000 + 8*1024 # all PIC32s have at least 16K RAM, use 8
        la      t0,BootloaderEntry     # boot address, always same location
        jalr    t0                     # jump and link so we can return here
        nop                            # required branch delay slot, executed

 *
 *
 *  4. edit parameters in the user defines section
 *  5. test
 *
 * todo - uses lots of stack!
 *
 *  . Compile with optimized, else bigger linker spaces
 *
 * n. Define for your PIC if not present
 * Read notes for help, info
 *
 * TODO: explain if use modified CRT, remove link option from linker
 * Theory of operation: todo
 ******************************************************************************/


/************************** User defines **************************************/
// You must set the clock speed the same as the boot up settings for the device
// this clock is used for timing and setting the UART baud rate
#define SYS_CLOCK 48000000L           // system clock, ticks go half this rate
#define TICKS_PER_MILLISECOND ((SYS_CLOCK)/2000)
#define TICKS_PER_MICROSECOND ((SYS_CLOCK)/2000000)

// define this to allow flashing the BOOT flash section
// this is recommended - the bootloader still protects its own
// code which is stored at the lowest FLASH addresses
#define ALLOW_BOOTFLASH_OVERWRITE

// UART baud rate
#define DESIRED_BAUDRATE 1000000   
// Define a UART (UART1, UART2, etc) to use. You must add code cases as needed
#define HC_UART1
// #define HC_UART2

// Number of milliseconds to look for flashing tool at boot. 
#define BOOT_WAIT_MS 1000

// define this to use encrypted images, else unencrypted
#define USE_CRYPTO

#ifdef USE_CRYPTO
// If encrypted, you need a 32 byte key, stored here as eight 4 byte values
// These get written as the key, word 0 first (lowest address), each stored
// big endian into a byte array
#define PASSWORD_WORD0 0x12345678
#define PASSWORD_WORD1 0x12345678
#define PASSWORD_WORD2 0x12345678
#define PASSWORD_WORD3 0x12345678
#define PASSWORD_WORD4 0x12345678
#define PASSWORD_WORD5 0x12345678
#define PASSWORD_WORD6 0x12345678
#define PASSWORD_WORD7 0x12345678
#endif


// To have some blinking LED feedback, define these for your device
// otherwise leave blank
//#define LED_INIT()
//#define LED_ON()
//#define LED_OFF()
//#define LED_TOGGLE()
// example, if PORTA, pin RA1, is tied to a LED:
#define LED_INIT()   LATACLR = 1<<1; TRISACLR = 1<<1
#define LED_ON()     PORTAbits.RA1=1
#define LED_OFF()    PORTAbits.RA1=0
#define LED_TOGGLE() PORTAbits.RA1^=1


// needed defines for each PIC type - todo - group them nicely
#if defined(__32MX150F128C__) || defined(__32MX150F128B__)
#define FLASH_PAGE_SIZE 1024 // bytes
#define FLASH_ROW_SIZE   128 // bytes

// memory regions, end is one past usable end
// all values are PHYSICAL addresses, not  logical
// most (all) are the same across chips
#define RAM_START            0x00000000
#define RAM_END              ((RAM_START) + (BMXDRMSZ))
#define FLASH_START          0x1D000000
#define FLASH_SIZE           (BMXPFMSZ)
#define FLASH_END            ((FLASH_START) + (FLASH_SIZE))
#define PERIPHERAL_START     0x1F800000
#define PERIPHERAL_END       0x1F900000
#define BOOT_START           0x1FC00000
#define BOOT_SIZE            (BMXBOOTSZ)
#define BOOT_END             ((BOOT_START) + (BOOT_SIZE))
// note config may be in the boot flash region
#define CONFIGURATION_START  0x1FC00BF0
#define CONFIGURATION_END    0x1FC00C00

