ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
// logical address for flash regions
#define FLASH_START_LOGICAL  0xBD000000
#define BOOT_START_LOGICAL   0xBFC00000



#else

error! need defines for your chip

#endif




/*********************** Notes *************************************************
 * 
 * Original idea to make a boot flash bootloader is fraught with problems:
 *  1. Boot flash is small, 3K = 0xD00, on many PICs
 *  2. Boot flash has a debug executive in it, and several fixed addresses
 *     that need exception vectors (Reset, boot exception, etc.)
 *  3. Debug executive takes significant space (0x760)
 *  4. These vectors are set to point to code in the CRT in non-boot flash at
 *     link time, so any recompile of the use app may move these vectors
 *  5. Could fiddle with linker script, and crt enough to make all work, ....
 *  6. But this is hard to maintain over time as crt changes....
 *  7. So - we make boot code at a fixed, protected address, and the user
 *     program should call it first thing. Then boot loader allows flashing the
 *     boot area itself to allow user changes to crt, etc.
 *  8. Downside - some chance of the boot loader wiping the code that is called
 *     before it.
 *  9. All this would be ok on 12K boot flash PICs. Make version for there.
 *
 * BOOT FLASH layout (3K version)
 * 0x0000 - 0x037F : 0x380 space, execution starts here
 * 0x0380 - 0x047F : space? boot exception vector
 * 0x0480 - 0x048F : 0x10 space, debug exception vector jumps into normal FLASH
 * 0x0490 - 0x0BDF : 0x760 space, debug code executive, needed to debug
 * 0x0BF0 - 0x0BFF configuration registers
 *
 * NOTE: config in boot flash - erasing this page erases config bits. Cannot do this!
 *       Thus we block all access to this page (0x800-0xBFF). This may break the
 *       debug executive, but should allow changes to be made to the exception vectors
 *       which is more important
 *
 * DEVCFG0 bits
 *    CP  : prevent flash reading/modification from external device 0=enabled, 1=disabled
 *    BWP : prevent boot flash from being modified during code execution 0=not writeable, 1=writeable
 *    PWP : prevent selected flash pages form being modified during code execution
 *        111111111 = disabled
 *        111111110 = address below 0x0400 protected
 *        111111101 = address below 0x0800 protected
 *        ....
 *        011111111 = address below 0x40000 (256K) protected
 *        ...
 *        000000000 = all possible memory protected
 *   ICESEL : ICD pins select PGECx/PGEDx x = 1,2,3,4 for bits 11,10,01,00
 *   JTAGEN, DEBUG,
 * DEVCFG1 bits : lots of watchdog timer stuff, clock oscillator stuff
 * DEVCFG2 bits : more clock stuff, USB stuff,
 * DEVCFG4 bits : USB stuff, peripheral pin stuff, USERID
 *
 *    
 *
 *
 *
 * // compile with size flags to make small enough
// why not in boot sector (contention...), avoids address of main using crt.0

 *

 * _RESET_ADDR, _BEV_EXCPT_ADDR, _DBG_EXCPT_ADDR and _DBG_CODE_ADDR are all
 * determined by the chip's hardware, cannot change them.
 *
 * _RESET_ADDR                    -- Reset Vector
 * _BEV_EXCPT_ADDR                -- Boot exception Vector
 * _DBG_EXCPT_ADDR                -- In-circuit Debugging Exception Vector
 * _DBG_CODE_ADDR                 -- In-circuit Debug Executive address
 * _DBG_CODE_SIZE                 -- In-circuit Debug Executive size
 * _GEN_EXCPT_ADDR                -- General Exception Vector
 *************************************************************************
_RESET_ADDR                    = 0xBFC00000;
_BEV_EXCPT_ADDR                = 0xBFC00380;
_DBG_EXCPT_ADDR                = 0xBFC00480;
_DBG_CODE_ADDR                 = 0x9FC00490;
_DBG_CODE_SIZE                 = 0x760;
_GEN_EXCPT_ADDR                = _ebase_address + 0x180;

 * Logical addresses
 * KSEG0  0x80000000 - 0x9FFFFFFF is the same (overlaps) as
 * KSEG1  0xA0000000 - 0xBFFFFFFF
 * RAM    0x80000000 & 0xA0000000
 * FLASH  0x9D000000 & 0xBD000000
 * Peripherals         0xBF8000000 ONLY

 * BOOT   0x9FC00000 & 0xBFC00000, LENGTH = 0xD00  (3K) or 0x3000 (12K)
 * CONFIG 0x9FC00BF0 & 0xBFC00BF0, LENGTH = 0x010  NOTE: overlaps boot flash!
 *
 * So, BOOT flash in 3K bootloaders is mostly used by Debug Executive, only have
 * 0x000 - 0x380 and 0x390-0x480 =
 *
 *
 * http://microchip.wikidot.com/32bit:mx-arch-exceptions-entry-points
 * The Reset, Soft Reset, and NMI exceptions are always vectored to location 0xBFC00000 (uncached, start-up safe KSEG1 region).


/*
 * TODO - future versions
 * Bootloader version at fixed address
 *
 *

 *
 C:\Users\Chris\SkyDrive\Hypnocube\Code\BootLoader.X\build\default\production>"\P
rogram Files (x86)\Microchip\xc32\v1.30\bin\xc32-objdump.exe" -S BootLoader.o |
more*
 *
// to use DEBUG_BOOTLOADER must make linker script mem larger

// all functions start with Boot and use BOOT_FUNC to locate properly
// can use x32-objdump -x Bootloader.o to see where items went
// can use gcc options to place data and functions in own sections to get more info
        // (in XC32/bin directory)

/* Features needed/desired
 *   1. UART (serial) support, possible Ethernet, SD card, SPI, etc?
 *   2. Can identify device to make sure not loading wrong items
 *   3. Protected from overwriting itself
 *   4. Setting of baud rate at compile time
 *   5. Encryption
 *   6. Compression
 *   7. Blinking LED when available
 *   8. Small RAM footprint (small enough for all PICs)
 *   9. Page size set by PIC type
 *  10. Error checking/re-transmission
 *  11. Fires on boot, waits, then if nothing, does normal main
 *  12. Small, works on all(?) PIC32?
 * . how to identify boot loading
 * . verify mode?
 * . CRC32K throughout
 *   . can also load unencrypted -
 *  . bootloader Version #
 * . error messages/bytes/stats
 * . NO: did not need - modified crt0.s must modify linker script - possibly can make same file with defines used here and included in linker script?
 * . explain how to check linker/load sections
 * . looked at symmetric and public key methods - if either decryption key lifted from device, irrelevant, so pick symmetric:
 * .chacha?
 *   - XXTEA seems good enough even though much weaker than AES. It's also very small
 *   - use ciphertext stealing to keep data short
 *   - use some block chaining format
 *   - send data in blocks with CRC allowing resends? Or one large block with CRC and verify?
 *   -
 */


// switch ACK in some cases to ACK,reason,CRC? used for counting progress on erase?
// //  x when erasing: send to the PC the number of pages to be erased, then send ack (BTLDR_ERASE) for each
//    erased page (in order to use progress bar in PC software). When finished send BTLDR_OK


