ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
/* Protocol
 * 1. Flasher application sends repeating ACK command over the serial port
 *    Note there may be no serial port, since the device is not powered up,
 *    so the flasher will poll the port.
 * 2. Power up Device to be flashed. It waits some amount of time (1 sec? 2 secs?)
 *    looking for an ACK command from the Flasher.
 * 3. If Device sees ACK, sends back ACK, enters command loop
 * 4. If Device does not see ACK within timeout, returns into user code.
 * Command Loop - this is a loop, in client/server mode:
 *    Flasher sends command, Device responds.
 *
 * Commands: (each ASCII byte, some have additional data)
 *    'I' (0x49) = Identify. No data. Respond ? bytes info
 *        Useful fields: bootloader version, product version, PIC version?
 *        memory locations
 *        Responds with DATA CRC
 *    'C' (0x43) = CRC. Compute CRC32K over all flash, and output text, then ACK.
 *    'E' (0x45) = Erase. Send 'E' Address CRC, responds ACK CRC
 *    'W' (0x57) = Write. Send 'W' Address Length CRC, returns ACK CRC or NACK CRC
 *    'Q' (0x51) = Quit. Send 'Q'CRC. Return ACK then Device exits boot loader.
 */

// todo - make sure no strings in here that are not in this boot flash
        
/* Notes:
 * 1. Boot loader and app must have same config bits. Needed to compile together to make all work nicely. TODO - test standalone app.
 *
 *
 *
 * From http://microchip.wikidot.com/faq:85  "(XC32) How do I link in my own custom startup-code, with the XC32 Compiler? "
 * 1. Copy the default startup code "crt0.S?, available under the folder ?<Compiler-DIR>\pic32-libs\libpic32\startup?, to your project directory.
 * 2. Customize this Startup code, by making the changes as required.
 * 3. Add this modified startup code (crt0.S) to the MPLAB® X IDE Project under ?Source Files?.
 *    You may also change the name of your custom startup code to something like 'my_startup.S'.
 * 4. Set the options to exclude linking of default Startup code.
 *    Under MPLAB X IDE go to:
 *    File ? Project Properties ? xc32-ld ? Option categories = Libraries ? Check the option 'Do not link startup code' ? Click 'Ok'
 * 5. The code will now link with the customized startup code.
 *    Note that the default startup code source, crt0.S, uses many device-specific macros that should be defined as appropriate for your target device.
 *
 *
 * I modified the file by adding the 4 lines:
 *      # added by Chris Lomont at hypnocube to enable the boot loader
        la      t0,BootloaderEntry
        jalr    t0
        nop
 *
 * before the section starting with:

        ##################################################################
        # Call main. We do this via a thunk in the text section so that
        # a normal jump and link can be used, enabling the startup code
        # to work properly whether main is written in MIPS16 or MIPS32
        # code. I.e., the linker will correctly adjust the JAL to JALX if
        # necessary
        ##################################################################
        and     a0,a0,0
        and     a1,a1,0
        la      t0,_main_entry
        jr      t0
        nop

 */

/* Usage
 * 1. Make new linker script from default one
 *    a. copy C:\Program Files (x86)\Microchip\xc32\v1.30\pic32mx\lib\ldscripts\elf32pic32mx.x
 *       to new script with .ld extension in linker files portion of the project.
 *    b.
 *
 *
 *
 *
 */

//


/*********************** defines, types, storage ******************************/
// define this to get state and other debugging messages
// moves the bootloader and does some other things
// makes image larger, so linker script may need modified to make room
// #define DEBUG_BOOTLOADER

// define this to cause flash operations to be ignored
// useful for testing when you don't want flash being changed
// #define IGNORE_FLASH_OPS

// addresses to protect the bootloader
#define BOOTLOADER_SIZE            0x2000 // must match linker script
#define BOOT_BASE_ADDRESS      0x1D000000 // note PHYSICAL address
#define BOOT_ENTRY_ADDRESS     0x9D000000 // note LOGICAL address

// number of 32-bit instructions matched to detect bootloader
#define BOOT_INSTRUCTION_COUNT 6
// max number of 32-bit instructions scanned to detect bootloader
#define BOOT_INSTRUCTION_SEEK  12


// space needed for buffer overhead when loading write packets
#define BUFFER_OVERHEAD 20

// internal ram buffer size used for temp storage
#define BUFFER_SIZE (FLASH_PAGE_SIZE+BUFFER_OVERHEAD)

// used to put code items into the boot rom section we defined in the linker script
#define BOOT_CODE __attribute__((section(".hcbcode")))

// used to put entry point into the boot rom section we defined in the linker script
// needs an extra section extension, else placed incorrectly in the section
#define BOOT_ENTRY __attribute__((section(".hcbcode.entry")))

// used to put data items into the boot rom section we defined in the linker script
// the ',r' part marks the data with a readonly attribute, for linker use
// use x for executable, b for BSS, r for read only, and d for writeable data
#define BOOT_DATA __attribute__((section(".hcbcode")))

// used to put items into the boot ram section we defined in the linker script
#define BOOT_RAM  __attribute__((section(".hcbram")))

// Any strings needed must be defined using this, to ensure the storage
// is in the proper flash section, otherwise the linker may put the
// text elsewhere
#define BOOTSTRING(name,text) BOOT_DATA static const char name[] = text

// use to set an item address. Requires logical address
#define FIX_ADDRESS(addr) __attribute__((address(addr)))

// times to retry a write before giving up
#define WRITE_RETY_MAX 5
        
// how to map logical addresses to physical addresses
#define LOGICAL_TO_PHYSICAL_ADDRESS(addr) ((addr)&0x1FFFFFFF)

// bootloader code version
#define BOOTLOADER_VERSION_MAJOR 0
#define BOOTLOADER_VERSION_MINOR 5

// Send \r\n to UART
#define ENDLINE()  {BootUARTWriteByte('\r');BootUARTWriteByte('\n'); }

