ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
#define CRYPTO_ROUNDS 20 // for 20 rounds of Salsa20

// the byte that signals a positive outcome to the flashing utility
// has nice property that becomes different values at nearby baud rates
#define ACK  0xFC

// NACK is a byte, starts with 0xF0, has 16 lower nibble (0x0C is ACK)
#define NACK(reason) BootUARTWriteByte(0xF0+reason)
// NACK reasons
enum {

    // write problems
    NACK_CRC_MISMATCH             = 0x00,
    NACK_PACKET_SIZE_TOO_LARGE    = 0x01,
    NACK_WRITE_WITHOUT_ERASE      = 0x02,
    NACK_WRITE_SIZE_ERROR         = 0x03,
    NACK_WRITE_MISALIGNED_ERROR   = 0x04,
    NACK_WRITE_WRAPS_ERROR        = 0x05,
    NACK_WRITE_OUT_OF_BOUNDS      = 0x06,
    NACK_WRITE_OVER_CONFIGURATION = 0x07,
    NACK_WRITE_BOOT_MISSING       = 0x08,
    NACK_WRITE_FLASH_FAILED       = 0x09,
    NACK_COMPARE_FAILED           = 0x0A,
    NACK_WRITES_FAILED            = 0x0B,

    // reserved for ACK
    NACK_ACK_RESERVED             = 0x0C, 

    // system problems
    NACK_UNKNOWN_COMMAND          = 0x0D,

    // erase problems
    NACK_ERASE_OUT_OF_BOUNDS      = 0x0E,
    NACK_ERASE_FAILED             = 0x0F,

};

// outcomes of the bootloader code, for querying
// by the application
enum {
    BOOT_RESULT_SKIPPED = 0,
    BOOT_RESULT_SUCCESSFUL = 1,
    BOOT_RESULT_POWER_EXIT = 2,
    BOOT_RESULT_STARTED = 3,
    BOOT_SET_HARDWARE_FAILED = -1,
    BOOT_RESULT_ASSUMPTIONS_FAILED = -2,
};

// one return variable at bottom of ram
// to access from main code, use :
// extern __attribute__((section(".hcram"))) uint8_t bootResult;
// this variable needs to persist past crt0, so uses the
// "persistent" attribute, which has linker script support
// by default from microchip. Otherwise this result will not be seen in the
// user code. See
// http://www.microchip.com/forums/m594242.aspx
// http://www.microchip.com/forums/m434737.aspx#434882
BOOT_RAM uint8_t bootResult  __attribute__ ((persistent));

// this define must match the address of the boot result
#define BOOT_RESULT_VIRTUAL_ADDRESS 0xA0000000

// structure for tracking a timer
typedef struct
{
    // for timing
    uint32_t timerLast, timerNext, timerExcess;
    uint32_t timerCount;// counts ms or us depending on the timer mode
    uint32_t ticksPerCount; // can count many things, 
} Timer_t;

#ifdef USE_CRYPTO
// crypto state
typedef struct
{
    int i;
    uint32_t state[16]; // crypto state
    uint32_t x[16];     // crypto temp
    uint8_t output[64];
    int32_t bytes,d64;
} Crypto_t;
#endif

// this is all the local storage the boot loader needs
typedef struct
{
    // used to see if flash erased command has completed
    // must be done before writing allowed
    bool flashErased;

    // used to track timeouts and delays
    Timer_t timeoutTimerMs;

    // used for delays while writing flash
    Timer_t nvmTimerUs;

    // buffer for receiving pacekt of data from the flash utility
    uint8_t buffer[BUFFER_SIZE];
    // where in buffer to put next byte read
    int readPos;
    // number of bytes in packet when finished
    int readMax;

    // place to store CRC calculations
    uint32_t transmittedCrc,computedCrc;

    // temp address for iterating over memory
    uint32_t curAddress;

    // number of pages attempted to be erased
    uint32_t pageEraseAttemptCount;

    // number of pages failing to erase
    uint32_t pageEraseFailureCount;
    
    // address and size of data to write from the buffer into flash
    uint32_t writeSize, writeAddress;

    // number of writes that failed
    // could be rows or single words
    uint32_t writeFailureCount;

    // count packets since last erase
    uint32_t packetCounter;

    // set to true on last write packet seen
    bool writesFinished;

    // counter used to retry writes a few times when flashing
    uint32_t writeRetryCounter;

    // space for result of a flash write
    uint32_t flashWriteResult;

#ifdef USE_CRYPTO
    Crypto_t crypto;
#endif

} Boot_t;

/**************************** UART section ***********************************/
#if 0
// if there is any UART error, return 1, else return 0
// todo - clear errors?
BOOT_CODE static int BootUARTError()
{
        int err =
        U1STAbits.OERR | // overrun error
        U1STAbits.FERR | // framing error
        U1STAbits.PERR ; // parity error

        err |=
        U2STAbits.OERR | // overrun error
        U2STAbits.FERR | // framing error
        U2STAbits.PERR ; // parity error

        return err!=0?1:0;
}

#endif

// read byte if one is ready.
// if exists, return true and byte
// if return false, byte = 0 is none avail, else
// byte != 0 means error
BOOT_CODE static bool BootUARTReadByte(uint8_t * byte)
    {
    // if data ready, get it
    if (U1STAbits.URXDA != 0)
    {
        *byte = U1RXREG;
        return true;
    }
    *byte = 0;
    return false;
    } // UARTReadByte


// blocking call to write byte to UART
BOOT_CODE static void BootUARTWriteByte(char byte)
{
#ifdef HC_UART1
        while (!U1STAbits.TRMT);   // wait till bit clear, then ready to transmit
        U1TXREG = byte; // write a byte
#else
        while (!U2STAbits.TRMT);   // wait till bit clear, then ready to transmit
        U2TXREG = byte; // write a byte
#endif
}

//#ifdef DEBUG_BOOTLOADER // removed this function from release version
// print the message to the serial port.
BOOT_CODE static void BootPrintSerial(const char * message)
{
    while (*message != 0)
    {
        BootUARTWriteByte(*message);
        message++;
    }
}
//#endif

// print the integer to the serial port.
BOOT_CODE static void BootPrintSerialInt(uint32_t value)
{
    uint32_t pow10 = 1; // stack, ends on 0, so ok

    // want value/10 < pow10 < value
    while (pow10 <= value/10)
        pow10 *= 10;

    do
    {
        uint32_t digit = value/pow10;
        BootUARTWriteByte(digit+'0');
        value -= digit*pow10;
        pow10 /=10;
    } while (pow10 > 0);
}

// print the integer to the serial port as a n byte hex value
BOOT_CODE static void BootPrintSerialHexN(uint32_t value, int n)
{
    int i; // todo - remove from stack? ends on zero, so ok?
    for (i = n; i > 0; --i)
    {
        int val = (value>>(n*4-4))&15;
        if (val < 10)
            BootUARTWriteByte(val+'0');
        else
            BootUARTWriteByte(val+'A'-10);
        value<<=4;
    }
}

// print the integer to the serial port as a 4 byte hex value
BOOT_CODE static void BootPrintSerialHex(uint32_t value)
{
    BootUARTWriteByte('0');
    BootUARTWriteByte('x');
    BootPrintSerialHexN(value, 8);
}

// initialize the serial port
BOOT_CODE static void BootUARTInit()
{

