ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
/*************************** Bootloader logic *********************************/

// instructions needed to jump into the bootloader. Checked below
BOOT_DATA static const uint32_t const bootloaderShim[BOOT_INSTRUCTION_COUNT] =
{0x3C1DA000, 0x37BD2000, 0x3C089D00, 0x25080000, 0x0100F809, 0x00000000};

// Check the address for bootloader code that jumps into the
// BootloaderEntry. This is used before overwriting the BOOT FLASH
// to ensure it looks like the bootloader will be called
BOOT_CODE bool BootDetectBootloaderShim(const uint32_t * address)
{
    /*
     * In the BOOT_FLASH, within a few instructions the following code sequence
     * must appear in order to jump back into the boot loader. The bootloader
     * will not erase and write this page without this code present.
     *
     *  la      sp,0xA0000000 + 8*1024 # all PIC32s have at least 16K RAM, use 8
     *  la      t0,BootloaderEntry     # boot address, always same location
     *  jalr    t0                     # jump and link so we can return here
     *  nop                            # required branch delay slot, executed
     *
     * To see what this code is in memory, assemble it in the crt0.S, and call
     *     BootPrintMemory("Boot flash entry bytes: ", 0xBFC00000,32);
     *
     * Boot flash entry bytes:
     * 0xBFC00000 : 00 A0 1D 3C 00 20 BD 37
     * 0xBFC00008 : 00 9D 08 3C 00 00 08 25
     * 0xBFC00010 : 09 F8 00 01 00 00 00 00
     * 0xBFC00018 : 00 60 1A 40 C0 04 5A 7F
     *
     * This decodes to
     *         3C1DA000        lui     sp,0xA000
     *         37BD2000        addiu   sp,0x2000
     *         3C089D00        lui     t0,0x9D00
     *         25080000        addiu   t0,0x0000
     *         0100F809        jalr    t0
     *         00000000        nop
     *
     * as can be deduced by disassembling the object file with
     *
     *  "\Program Files (x86)\Microchip\xc32\v1.30\bin\xc32-objdump.exe" -d
     *     BootLoader_crt0.o | more
     *
     * So we look for the sequence
     *    0x3C1DA000, 0x27BD2000, 0x3C089D00, 0x25080000, 0x0100F809, 0x00000000
     * 
     * */

    int i,j; 
    for (i = 0; i < BOOT_INSTRUCTION_SEEK - BOOT_INSTRUCTION_COUNT; ++i)
    {       
        bool found = true;
        for (j = 0; j < BOOT_INSTRUCTION_COUNT; ++j)
        {
            if (address[i+j] != bootloaderShim[j])
                found = false;       
        }
        if (found)
        {
            i=j=0;
            return true;
        }
    }

    i=j=0;
    return false; // did not match
}

// check assumptions needed for proper function
// return true on success, else false
BOOT_CODE bool BootTestAssumptions()
{
    /* TODO
     * Things to check
     *  1. flash writeable
     *  2. program entry is right address
     *  3. check where strings are stored (if any) - must be in proper FLASH place
     *
     */

    // check entry address
    if ((uint32_t)(&BootloaderEntry) != BOOT_ENTRY_ADDRESS)
        return false;

    // check string addresses working
    // BootDebugPrintE("TODO - test string addresses in BootTestAssumptions")
    //if ((uint32_t)BOOTLOADER_VERSION < BOOT_ENTRY_ADDRESS || (BOOT_ENTRY_ADDRESS+BOOTLOADER_SIZE) < (uint32_t)BOOTLOADER_VERSION)
    //    return false;

    // test bootloaderShim, want in boot code
    if ((uint32_t)bootloaderShim < BOOT_ENTRY_ADDRESS || (BOOT_ENTRY_ADDRESS+BOOTLOADER_SIZE) < (uint32_t)bootloaderShim)
        return false;

    //// check boot code in place in crt0 at the reset vector
    if (!BootDetectBootloaderShim((uint32_t*)BOOT_START_LOGICAL))
        return false;
    
    // check ram address working
    if ((uint32_t)&bootResult != BOOT_RESULT_VIRTUAL_ADDRESS)
        return false;

    return true;
}

BOOTSTRING(infoText01,"Testing info strings");

BOOT_CODE static void BootCommandInfo(Boot_t * bs)
{
    BootUARTWriteByte('T');
    BootPrintSerial(infoText01);


#ifdef DEBUG_BOOTLOADER
#define DUMPHEX(txt,val) BootPrintSerial(txt); \
    BootPrintSerialHex(val); \
    ENDLINE();

#define DUMPINT(txt,val) BootPrintSerial(txt); \
    BootPrintSerialInt(val); \
    ENDLINE();
#else
#define DUMPHEX(txt,val) \
    BootPrintSerialHex(val); 

#define DUMPINT(txt,val) \
    BootPrintSerialInt(val); 
#endif

    // BootPrintSerialHex((uint32_t)BOOTLOADER_VERSION);

    BootUARTWriteByte('1');

    // chip and code versions
    BootDebugPrint("Bootloader Version    : ");
    
    BootUARTWriteByte('2');

    BootUARTWriteByte('0'+BOOTLOADER_VERSION_MAJOR);

    BootUARTWriteByte('3');

    BootUARTWriteByte('.');

    BootUARTWriteByte('3');

    BootUARTWriteByte('0'+BOOTLOADER_VERSION_MINOR);

    ENDLINE();

    DUMPHEX("DEVID                 : ", DEVIDbits.DEVID);
    DUMPHEX("DEVID Ver             : ", DEVIDbits.VER);

    BootUARTWriteByte('V');


#ifdef DEBUG_BOOTLOADER

    BootPrintMemory("Boot flash entry bytes: ", 0xBFC00000,32);



    int seen = BootDetectBootloaderShim((uint32_t*)BOOT_START_LOGICAL);
    DUMPHEX("Boot shim detected    : ", seen);

    // memory
    DUMPHEX("RAM size              : ", RAM_END - RAM_START);
    DUMPHEX("FLASH size            : ", FLASH_END - FLASH_START);
    DUMPHEX("Peripheral size       : ", PERIPHERAL_END - PERIPHERAL_START);
    DUMPHEX("BOOT size             : ", BOOT_END - BOOT_START);
    DUMPHEX("Configuration size    : ", CONFIGURATION_END - CONFIGURATION_START);
    DUMPINT("BOOT struct size      : ", sizeof(Boot_t));

    // addresses
    DUMPHEX("Bootloader address    : ",(uint32_t)(&BootloaderEntry));
    // DUMPHEX("String address        : ",(uint32_t)BOOTLOADER_VERSION);
    DUMPHEX("Boot result address   : ",(uint32_t)&bootResult);

    // some memory dump to help debugging
    // BootPrintMemory("Mem at 0x9D00 2000: ", 0x9D002000, 8*16);

#endif
    

#undef DUMPHEX // clean up
#undef DUMPINT

    // final ack to denote finised
    BootUARTWriteByte(ACK);
    
} // BootCommandInfo

// return true if can modify this address range without hurting bootloader
// or configuration bits. 
BOOT_CODE static bool BootModifyAddressesAllowed(uint32_t address, uint32_t length)
{
    // protect the bootloader code itself
    if (BootOverlap(
            address, address+length,
            BOOT_BASE_ADDRESS, BOOT_BASE_ADDRESS+BOOTLOADER_SIZE) != 0
            )
    {
        BootUARTWriteByte('B');
        return false; // would overwrite boot code
    }

#ifndef ALLOW_BOOTFLASH_OVERWRITE
    // protect the boot flash section
    if (BootOverlap(
            address, address+length,
            BOOT_START, BOOT_END) != 0
            )
    {
        BootUARTWriteByte('S');
        return false; // would overwrite boot flash
    }
#endif
    // protect the config flash entire PAGE
    // since we disallow page erasing, disallow page writing, else corruption
    if (BootOverlap(
            address, address+length,
            // round down to page
            (CONFIGURATION_START) & (~(FLASH_PAGE_SIZE-1)),
            // round up to page
            (CONFIGURATION_END+FLASH_PAGE_SIZE-1) & (~(FLASH_PAGE_SIZE-1)) 
            ) != 0
            )
    {
        BootUARTWriteByte('C');
        return false; // would overwrite configuration bits
    }

