ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
    return true;
}


// erase the range of pages stored in
// boot struct writeAddress of writeSize length
// skips overwrites of bootloader protected regions
BOOT_CODE static void BootEraseHelper(Boot_t * bs)
{
    for (bs->curAddress = bs->writeAddress; bs->curAddress < bs->writeAddress + bs->writeSize; bs->curAddress += FLASH_PAGE_SIZE)
    {
#ifdef DEBUG_BOOTLOADER
        BootDebugPrint("Erase address: ");
        BootPrintSerialHex(bs->curAddress);

        BootDebugPrint(" (");
        BootPrintSerialInt((bs->curAddress - FLASH_START)/FLASH_PAGE_SIZE);
        BootDebugPrintE(")");
#else
#endif

        BootPrintSerialHex(bs->curAddress);

        // do not erase bootloader addresses - just skip them
        if (BootModifyAddressesAllowed(bs->curAddress,FLASH_PAGE_SIZE))
        {

            // special case. Even if we're allowed to erase the BOOT_START page,
            // we do not do so here. We only do it when it is about to be
            // written, in order to protect the bootloader path
            if (bs->curAddress != BOOT_START && BootNVMemErasePage(bs,bs->curAddress))
            { // success
                // allows progress bar
                BootUARTWriteByte(ACK);
            }
            else
            { // erase failed
                bs->pageEraseFailureCount++;
                // allows progress bar
                NACK(NACK_ERASE_FAILED);
            }
        }
        else
        { // write blocked
            // allows progress bar
            NACK(NACK_ERASE_OUT_OF_BOUNDS);
        }

        bs->pageEraseAttemptCount++;
        LED_TOGGLE();

        //BootPrintSerial('\r');
        //BootPrintSerial('\n');
    }

#ifdef DEBUG_BOOTLOADER
        BootPrintSerialInt(bs->pageEraseFailureCount);
        BootDebugPrint(" pages failed out of ");
        BootPrintSerialInt(bs->pageEraseAttemptCount);
        BootDebugPrintE(" total.");
#endif

} // BootCommandErase

// erase FLASH
BOOT_CODE static void BootCommandErase(Boot_t * bs)
{
    BootDebugPrintE("Erasing flash....");

#ifdef DEBUG_BOOTLOADER
    BootDebugPrint("Page size: ");
    BootPrintSerialHex(FLASH_PAGE_SIZE);
    ENDLINE();
    BootDebugPrint("Page start: ");
    BootPrintSerialHex(FLASH_START);
    ENDLINE();
    BootDebugPrint("Page end: ");
    BootPrintSerialHex(FLASH_END);
    ENDLINE();
#endif

    bs->pageEraseAttemptCount = 0; // track for stats
    bs->pageEraseFailureCount = 0; // count failures


    // erase normal flash
    bs->writeAddress = FLASH_START;
    bs->writeSize    = FLASH_END - FLASH_START;
    BootEraseHelper(bs);

    // erase boot flash
    // thse addressed are protected if necessary in a deeper function
    // to keep a consistent count of pages tried for progress bars
    bs->writeAddress = BOOT_START;
    bs->writeSize    = BOOT_END - BOOT_START;
    BootEraseHelper(bs);


    // needed done before writing is allowed
    // todo - if ever set up so no errors on a correct erase, then
    // make this only set to true during success
    bs->flashErased = true;

    // one final ack or nack based on success
    if (bs->pageEraseFailureCount != 0)
        NACK(NACK_ERASE_FAILED); // send an error reply
    else
    {
        BootUARTWriteByte(ACK);
    }
}


// write the data in bs fields: buffer, writeSize, writeAddress
// return NACK_ACK_RESERVED on success, else a NACK_ code for the error
BOOT_CODE static uint32_t BootWriteFlash(Boot_t * bs)
{
    // check writing is allowed (required an erase first)
    if (bs->flashErased == false)
    {
        // failed, since erase not done
        BootDebugPrintE("Write requires erase first");
        return NACK_WRITE_WITHOUT_ERASE;
    }

    // check length (must be page length? or multiple?)
    // only allow at most one page for now
    if (FLASH_PAGE_SIZE < bs->writeSize || bs->writeSize <= 0 || (bs->writeSize&3)!=0)
    {
        // failed, too large write
        BootDebugPrintE("Write too large or zero or not multiple of 4");
        return NACK_WRITE_SIZE_ERROR;
    }

    // check address is 4 byte aligned
    if ((bs->writeAddress & 3) != 0)
    {
        BootDebugPrintE("Write not aligned");
        return NACK_WRITE_MISALIGNED_ERROR;
    }

    // check no wraparound (note size > 0 here)
    if (bs->writeAddress > 0xFFFFFFFF - (bs->writeSize-1))
    {
        BootDebugPrintE("Write wraps around address space");
        return NACK_WRITE_WRAPS_ERROR;
    }

    // check address (in range, proper boundary)
    if (!BootModifyAddressesAllowed(bs->writeAddress, bs->writeSize))
    {
        // failed, out of flash range
        BootDebugPrintE("Write outside flash range");
        return NACK_WRITE_OUT_OF_BOUNDS;
    }

    // special BOOT_START page handling
    // if the address is the start of the boot page, and the write contains
    // code to jump into the bootloader, erase the page.
    if (bs->writeAddress == BOOT_START)
    {
        // this is a special case. If we got here, and we are about to overwrite 
        // the boot page, ensure what we are writing contains the proper boot
        // code, is long enough. If all is ok, then erase the page first

        if (bs->writeSize < BOOT_INSTRUCTION_SEEK*4)
        {
            // failed, we require the boot sector to be aligned and at least long enough
            BootDebugPrintE("Write boot requires enough size");
            return NACK_WRITE_OUT_OF_BOUNDS;
        }

        // Check the address for bootloader code that jumps into the
        // BootloaderEntry. This is used before overwriting the BOOT FLASH
        // to ensure it looks like the bootloader will be called
        if (!BootDetectBootloaderShim((uint32_t*)&(bs->buffer)))
        {
            // failed, does not contain the bootloader header needed
            BootDebugPrintE("Bootloader shim missing");
            return NACK_WRITE_BOOT_MISSING;
        }

        if (!BootNVMemErasePage(bs,bs->writeAddress))
        { // failure to erase page
            // failed, erase no good
            BootDebugPrintE("Bootloader erase failed!");
            return NACK_ERASE_FAILED;
        }
    }



    // do not overwrite cfg - requires special writing mode - can do if careful
    // currently redundant, but left in for future error catching
    if (
        BootOverlap(bs->writeAddress, bs->writeAddress + bs->writeSize,
        CONFIGURATION_START, CONFIGURATION_END) > 0)
    {
        // failed, overwriting configuration bits
        BootDebugPrintE("Cannot write over configuration");
        return NACK_WRITE_OVER_CONFIGURATION;
    }

