ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
    // write FLASH loop

    // address to write
    bs->curAddress = bs->writeAddress;
    bs->writeFailureCount = 0;
    while (bs->curAddress < bs->writeAddress + bs->writeSize)
    { // write largest chunk possible        
        if (((bs->curAddress & (FLASH_ROW_SIZE-1))==0) && (FLASH_ROW_SIZE <= bs->writeAddress + bs->writeSize - bs->curAddress))
        { // row aligned and long enough
            BootUARTWriteByte('R');

            if (BootNVMemWriteRow(bs,
                bs->curAddress,
                (uint32_t*)(LOGICAL_TO_PHYSICAL_ADDRESS(((uint32_t)(bs->buffer + (bs->curAddress - bs->writeAddress)))))
                ) == false)
            {
                BootUARTWriteByte('-');
                bs->writeFailureCount++;
            }
            bs->curAddress  += FLASH_ROW_SIZE;
        }
        else
        { // long enough for word write
            BootUARTWriteByte('W');
            if (BootNVMemWriteWord(bs,bs->curAddress,
                    *((uint32_t*)(bs->buffer + bs->curAddress - bs->writeAddress))
                    ) == false)
            {
                BootUARTWriteByte('-');
                bs->writeFailureCount++;
            }
            bs->curAddress  += 4;
        }
    }

    if (bs->writeFailureCount != 0)
    {
        BootDebugPrintE("Writes failed");
        return NACK_WRITES_FAILED;
    }

    return NACK_ACK_RESERVED; // success
} // BootWriteFlash

/*
 * Each write block has the following format
 * byte  0           : 'W' (0x57) the write command.
 * bytes 1-2         : big endian 16-bit unsigned payload length P
 *                     in 0-65535. 
 * bytes 3-(P+2)     : P bytes of payload
 *
 * The payload is encrypted or not depending on bootloader configuration.
 * If encrypted, the payload (including CRC!) is decrypted first. 
 * 
 * If encrypted, the first write block contains a 16-bit unsigned big endian
 * length P = 12, then an 8 byte initialization vector (IV) to be used to
 * initialize the crypto, followed by a 32-bit CRC value over the 8 byte IV.
 *
 * After the possible first encrypted block, all blocks contain data to be
 * written to flash. Such a data block is stored in the length P payload,
 * with data bytes first, then a 32 bit big endian unsigned 32-bit address
 * where the data goes, then a big endian 16-bit length of data to write
 * (allowing padding the payload to assist encryption by hiding the actual
 * data size), followed by a 32-bit CRC value over the data, (optional) padding,
 * address, and length fields.
 *
 * If encrypted, the entire payload needs decrypted before reading the values.
 *
 * Thus the block looks like (offsets from the start of the payload, add 3 for
 * offsets from the block start):
 *
 * bytes 0-(P-11)     : P-11 bytes of data.
 * bytes (P-10)-(P-7) : big endian unsigned 32-bit start address A.
 * bytes (P-6)-(P-5)  : big endian 16-bit actual length L to write.
 * bytes (P-4)-(P-1)  : 4 byte CRC32K of unencrypted data and address and length
 * A packet with payload length 0 (no address, no CRC, nothing) marks the end of
 * the packets.
 * */

// write incoming flash packet
BOOT_CODE static void BootCommandWrite(Boot_t * bs)
{
    // on entry, the 'W' command byte is already read...

    // get two length bytes
    bs->readPos = 0;
    while (bs->readPos < 2)
    {
        if (BootUARTReadByte(&bs->buffer[bs->readPos]))
            bs->readPos++;
    }

    // compute length of payload and reset the counter
    bs->readMax = 256*bs->buffer[0] + bs->buffer[1];
    bs->readPos = 0;  // start back at buffer start

    // check size
    if (bs->readMax >= BUFFER_SIZE)
    {
        BootDebugPrintE("Packet length larger than buffer");
        NACK(NACK_PACKET_SIZE_TOO_LARGE);
        return;
    }

    // see if was last packet
    if (bs->readMax == 0)
    {
        BootDebugPrintE("Last packet seen");
        bs->writesFinished = true;
        // final ACK
        BootUARTWriteByte(ACK);
        return;
    }

    // read rest of packet
    while (bs->readPos < bs->readMax)
    {
        if (BootUARTReadByte(&(bs->buffer[bs->readPos])))
            bs->readPos++;
    }

    // increment packets received
    bs->packetCounter++;


    // payload now in buffer 0-(P-1)
#ifdef DEBUG_BOOTLOADER
    BootDebugPrint("Write packet length ");
    BootPrintSerialHex(bs->readMax);
    ENDLINE();
#endif

#ifdef USE_CRYPTO
    // decrypt if needed before testing checksums
    if (bs->packetCounter != 1)
    { // was not the crypto IV packet, so decrypt

        BootDebugPrintE("Decrypting packet");

        //BootPrintMemory("Encrypted bytes: ", bs->buffer, 16);
        //BootPrintMemory("Encryptor state ", bs->crypto.state, 64);

        // note encrypt and decrypt are the same function
        BootCryptoDecrypt(
            &(bs->crypto),
            bs->buffer,  // the output message
            bs->readMax, // message length
            bs->buffer,  // the cipher bytes
            CRYPTO_ROUNDS);

        //BootPrintMemory("Decrypted bytes: ", bs->buffer, 16);
    }

#endif

    // verify packet checksum
    bs->computedCrc = 0;
    for (bs->readPos = 0; bs->readPos <= bs->readMax-4-1; bs->readPos++)
    {
#if 0 // DEBUG_MESSAGES
        // show initial and final bytes, for debugging
        int i = bs->readPos;
        if (i < 5 || i > bs->readMax-4-1 - 5)
        {
        BootDebugPrint("Check byte ");
        BootPrintSerialHex(i);
        BootDebugPrint(" -> ");
        BootPrintSerialHex(bs->buffer[bs->tempInt1]);
        ENDLINE();
        }
#endif
        bs->computedCrc = BootCrc32AddByteBitwise(bs->buffer[bs->readPos], bs->computedCrc);
    }

#ifdef DEBUG_BOOTLOADER
    BootDebugPrint("Computed checksum     : ");
    BootPrintSerialHex(bs->computedCrc);
    ENDLINE();
#endif

    // read transmitted CRC
    BootReadBigEndian(&(bs->transmittedCrc),bs->buffer+bs->readMax-4,4);

#ifdef DEBUG_BOOTLOADER
    BootDebugPrint("Transmitted checksum  : ");
    BootPrintSerialHex(bs->transmittedCrc);
    ENDLINE();
#endif

    if (bs->computedCrc != bs->transmittedCrc)
    { // crc mismatch
        BootDebugPrintE("CRC mismatch");
        NACK(NACK_CRC_MISMATCH);
        return;
    }

#ifdef USE_CRYPTO
    if (bs->packetCounter == 1)
    { // packet contains 8 byte decryption initialization vector (IV)

        BootDebugPrintE("Crypto info packet read");

        // write password into buffer
        // stored as key, word 0 first (lowest address), each stored
        // big endian into a byte array as the key

