ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
#define WRITEKEY(ptr,val) (ptr)[3] = (uint8_t)val; \
        (ptr)[2] = (uint8_t)((val)>>8);            \
        (ptr)[1] = (uint8_t)((val)>>16);           \
        (ptr)[0] = (uint8_t)((val)>>24)

        WRITEKEY(bs->buffer+ 8, PASSWORD_WORD0);
        WRITEKEY(bs->buffer+12, PASSWORD_WORD1);
        WRITEKEY(bs->buffer+16, PASSWORD_WORD2);
        WRITEKEY(bs->buffer+20, PASSWORD_WORD3);
        WRITEKEY(bs->buffer+24, PASSWORD_WORD4);
        WRITEKEY(bs->buffer+28, PASSWORD_WORD5);
        WRITEKEY(bs->buffer+32, PASSWORD_WORD6);
        WRITEKEY(bs->buffer+36, PASSWORD_WORD7);
#undef WRITEKEY // clean up to avoid errors
        
        // Set the 32 byte key
        // Set the initialization vector, 64 bits
        BootCryptoSetKeyAndInitializationVector(
            &(bs->crypto),
            bs->buffer + 8, // 32 byte key (from internal values)
            32*8,           // key length in bits
            bs->buffer      // 8 byte IV
        );

        // ack success
        BootUARTWriteByte(ACK);
        return;
    }
#endif


    // get write size and address
    BootReadBigEndian(&(bs->writeSize),bs->buffer+bs->readMax-4-2,2);
    BootReadBigEndian(&(bs->writeAddress),bs->buffer+bs->readMax-4-6,4);

//#ifdef DEBUG_BOOTLOADER
    BootDebugPrint("Writing ");
    BootPrintSerialHex(bs->writeSize);
    BootDebugPrint(" to address ");
    BootPrintSerialHex(bs->writeAddress);
    ENDLINE();
//#endif

    // loop on writing a few times in case first pass fails
    bs->writeRetryCounter = 0;

    do 
    {
        bs->flashWriteResult = BootWriteFlash(bs);
        if (bs->flashWriteResult != NACK_ACK_RESERVED)
        {
            BootDebugPrintE("Flash write failed ");
            // here is the reason
            NACK(bs->flashWriteResult);
            if (bs->writeRetryCounter > WRITE_RETY_MAX)
            {
                return; // had enough, so bail
            }
        }

        // check what was written
        BootDebugPrintE("Comparing flash to buffer....");
        for (bs->readPos = 0; bs->readPos < bs->writeSize; bs->readPos++)
        {
            bs->curAddress = bs->writeAddress+bs->readPos;
            bs->curAddress |= 0x80000000; // physical to logical
            if (bs->buffer[bs->readPos] != (*((uint8_t*)(bs->curAddress))))
            {
                bs->flashWriteResult = NACK_COMPARE_FAILED;
    #ifdef DEBUG_BOOTLOADER
                BootDebugPrint("Compare flash to buffer failed. Address ");
                BootPrintSerialHex(bs->curAddress);
                BootDebugPrint(", ");
                BootPrintSerialInt((uint32_t)bs->buffer[bs->readPos]);
                BootDebugPrint(" != ");
                BootPrintSerialInt((uint32_t) (*((uint8_t*)(bs->curAddress))) );
                ENDLINE();
    #endif
                NACK(NACK_COMPARE_FAILED);
                if (bs->writeRetryCounter > WRITE_RETY_MAX)
                {
                    return; // had enough, so bail
                }

            }
        }
        bs->writeRetryCounter++;
    } while (bs->writeRetryCounter < WRITE_RETY_MAX &&
             bs->flashWriteResult != NACK_ACK_RESERVED);

    // final ACK
    BootUARTWriteByte(ACK);
}

// compute and output CRC32 for all flash
BOOT_CODE static void BootCommandCRC(Boot_t * bs)
{
    bs->computedCrc = 0;

    // main flash
    for (bs->curAddress = FLASH_START_LOGICAL;
            bs->curAddress < FLASH_START_LOGICAL+FLASH_SIZE; ++ bs->curAddress)
    {
        bs->computedCrc = BootCrc32AddByteBitwise(*((uint8_t*)bs->curAddress), bs->computedCrc);
    }

    // BOOT flash
    for (bs->curAddress = BOOT_START_LOGICAL;
            bs->curAddress < BOOT_START_LOGICAL+BOOT_SIZE; ++ bs->curAddress)
    {
        bs->computedCrc = BootCrc32AddByteBitwise(*((uint8_t*)bs->curAddress), bs->computedCrc);
    }

    BootPrintSerialHex(bs->computedCrc);

    // final ACK
    BootUARTWriteByte(ACK);

}


/*
 * Command Loop - this is a loop, in client/server mode, Flasher sends command,
 *    Device responds.
 *
 * Commands: have form [command byte]([address 32 bits][length][data])[CRC]
 *    'I' (0x49) = Identify. No data. Respond ? bytes info
 *        Useful fields: bootloader version, product version, PIC version?
 *        Responds with DATA CRC
 *    'E' (0x45) = Erase. Send 'E' Address CRC, responds ACK CRC
 *    'W' (0x57) = Write. Send 'W' Address Length CRC, returns ACK CRC or NACK CRC
 *    'Q' (0x51) = Quit. Send 'Q'CRC. Return ACK then Device exits boot loader.
 */

BOOT_CODE static void BootRunCommandLoop(Boot_t * bs)
{
    // set the packet counter back to zero
    bs->packetCounter = 0;
    bs->writesFinished = false;
    
    while (1)
    {
        // get command on timeout
        while (!BootUARTReadByte(bs->buffer))
        {
            // do nothing
        }

        BootUARTWriteByte('Z');

        switch (bs->buffer[0])
        {
            case 'I' : // information
                // BootDebugPrintE("Information command");
                BootCommandInfo(bs);
                break;
            case 'E' : // erase
                //BootDebugPrintE("Erase command");
                BootCommandErase(bs);
                bs->packetCounter = 0;
                bs->writesFinished = false;

                BootUARTWriteByte('X');
                
                break;
            case 'C' : // CRC everything
                BootCommandCRC(bs);
                break;
            case 'W' : // write
                //BootDebugPrintE("Write command");
                BootCommandWrite(bs);
                break;
            case 'Q' : // quit
                //BootDebugPrintE("Quit command");
                return;
            case ACK :// ACK - late entry? if so, ACK back to resync
                BootUARTWriteByte(ACK);
                break;
            default :
#ifdef DEBUG_BOOTLOADER
                BootDebugPrint("DEVICE: Unknown command ");
                BootPrintSerialInt((int)(bs->buffer[0]));
                ENDLINE();
#endif
                NACK(NACK_UNKNOWN_COMMAND);
                break;
        }
    }
}

